CSI API ETABS v1
cPointElm.IsSpringCoupled Method
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int IsSpringCoupled(
	string Name,
	ref bool IsCoupled
)
Function IsSpringCoupled (
	Name As String,
	ByRef IsCoupled As Boolean
) As Integer
Dim instance As cPointElm
Dim Name As String
Dim IsCoupled As Boolean
Dim returnValue As Integer
returnValue = instance.IsSpringCoupled(Name,
	IsCoupled)
int IsSpringCoupled(
	String^ Name,
	bool% IsCoupled
)
abstract IsSpringCoupled :
        Name : string *
        IsCoupled : bool byref -> int
Parameters
Name
Type: System.String
IsCoupled
Type: System.Boolean
Return Value
Type: Int32
See Also
Reference
cPointElm Interface
ETABSv1 Namespace